InformationRegisters/ОстаткиПродукцииВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ОстаткиПродукцииВЕТИС</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмеренияВЕТИС</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмеренияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВЕТИС</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ПродукцияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаписьСкладскогоЖурнала</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозяйствующийСубъект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйствующиеСубъектыВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВходящаяТранспортнаяОперацияВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ВходящаяТранспортнаяОперацияВЕТИС</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СерияТТН</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузоотправительПредприятие</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТН</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузоотправительХозяйствующийСубъект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйствующиеСубъектыВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузополучательХозяйствующийСубъект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйствующиеСубъектыВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузополучательПредприятие</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВходящаяТранспортнаяОперацияВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТТН</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТТН</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХранения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыХраненияПриТранспортировкеВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеревозчикХозяйствующийСубъект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйствующиеСубъектыВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранспортногоСредства</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВетеринарноСопроводительныйДокумент</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ВетеринарноСопроводительныйДокументВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверкиПравилРегионализации</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыПроверкиПравилРегионализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ПродукцияВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВЕТИС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатурыВЕТИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияВЕТИС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмеренияВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвращаемоеКоличествоВЕТИС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПартии</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МаршрутВозврата</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маршрут</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварыУточнение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОстаткиПродукцииВЕТИС/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
&Вместо("ЗаполнитьРеквизитыПоПродукции")
Процедура КочетовЗаполнитьРеквизитыПоПродукции(Продукция1)
	РеквизитыПродукции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Продукция1,
		"ТипПродукции,Продукция,ВидПродукции");
		
	ЭтаФорма.Продукция    = Продукция1;
	//ТипПродукции = РеквизитыПродукции.ТипПродукции;
	//ВидПродукции = РеквизитыПродукции.ВидПродукции;

КонецПроцедуры

&НаСервере
Процедура КочетовНоменклатураПриИзмененииВместоНаСервере()
	
	Если не ЗначениеЗаполнено(Номенклатура) Тогда
		Список.ТекстЗапроса="ВЫБРАТЬ
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.НомерЗаписи КАК НомерЗаписи,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.Статус КАК Статус,
		                    |	ОстаткиПродукцииВЕТИС.Продукция КАК Продукция,
		                    |	ОстаткиПродукцииВЕТИС.ХозяйствующийСубъект КАК ХозяйствующийСубъект,
		                    |	ОстаткиПродукцииВЕТИС.Предприятие КАК Предприятие,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваНачалоПериода КАК ДатаПроизводства,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиНачалоПериода КАК СрокГодности,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала КАК ЗаписьСкладскогоЖурнала,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваСтрока КАК ДатаПроизводстваСтрока,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваТочностьЗаполнения КАК ДатаПроизводстваТочностьЗаполнения,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваНачалоПериода КАК ДатаПроизводстваНачалоПериода,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваКонецПериода КАК ДатаПроизводстваКонецПериода,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиСтрока КАК СрокГодностиСтрока,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиТочностьЗаполнения КАК СрокГодностиТочностьЗаполнения,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиНачалоПериода КАК СрокГодностиНачалоПериода,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиКонецПериода КАК СрокГодностиКонецПериода,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СтранаПроизводства КАК СтранаПроизводства,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СкоропортящаясяПродукция КАК СкоропортящаясяПродукция,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.НизкокачественнаяПродукция КАК НизкокачественнаяПродукция,
		                    |	ОстаткиПродукцииВЕТИС.ЕдиницаИзмеренияВЕТИС КАК ЕдиницаИзмеренияВЕТИС,
		                    |	ОстаткиПродукцииВЕТИС.КоличествоВЕТИС КАК КоличествоВЕТИС
		                    |ИЗ
		                    |	РегистрСведений.ОстаткиПродукцииВЕТИС КАК ОстаткиПродукцииВЕТИС";
	Иначе                                                                
		Список.ТекстЗапроса="ВЫБРАТЬ
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.НомерЗаписи КАК НомерЗаписи,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.Статус КАК Статус,
		                    |	ОстаткиПродукцииВЕТИС.Продукция КАК Продукция,
		                    |	ОстаткиПродукцииВЕТИС.ХозяйствующийСубъект КАК ХозяйствующийСубъект,
		                    |	ОстаткиПродукцииВЕТИС.Предприятие КАК Предприятие,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваНачалоПериода КАК ДатаПроизводства,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиНачалоПериода КАК СрокГодности,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала КАК ЗаписьСкладскогоЖурнала,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваСтрока КАК ДатаПроизводстваСтрока,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваТочностьЗаполнения КАК ДатаПроизводстваТочностьЗаполнения,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваНачалоПериода КАК ДатаПроизводстваНачалоПериода,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваКонецПериода КАК ДатаПроизводстваКонецПериода,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиСтрока КАК СрокГодностиСтрока,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиТочностьЗаполнения КАК СрокГодностиТочностьЗаполнения,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиНачалоПериода КАК СрокГодностиНачалоПериода,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиКонецПериода КАК СрокГодностиКонецПериода,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СтранаПроизводства КАК СтранаПроизводства,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СкоропортящаясяПродукция КАК СкоропортящаясяПродукция,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.НизкокачественнаяПродукция КАК НизкокачественнаяПродукция,
		                    |	ОстаткиПродукцииВЕТИС.ЕдиницаИзмеренияВЕТИС КАК ЕдиницаИзмеренияВЕТИС,
		                    |	ОстаткиПродукцииВЕТИС.КоличествоВЕТИС КАК КоличествоВЕТИС
		                    |ИЗ
		                    |	РегистрСведений.ОстаткиПродукцииВЕТИС КАК ОстаткиПродукцииВЕТИС
		                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                    |			ВходящаяТранспортнаяОперацияВЕТИСТовары.Продукция КАК Продукция
		                    |		ИЗ
		                    |			Документ.ВходящаяТранспортнаяОперацияВЕТИС.Товары КАК ВходящаяТранспортнаяОперацияВЕТИСТовары
		                    |		ГДЕ
		                    |			ВходящаяТранспортнаяОперацияВЕТИСТовары.Ссылка.Проведен
		                    |			И ВходящаяТранспортнаяОперацияВЕТИСТовары.Номенклатура = &Номенклатура
		                    |		
		                    |		СГРУППИРОВАТЬ ПО
		                    |			ВходящаяТранспортнаяОперацияВЕТИСТовары.Продукция) КАК ВложенныйЗапрос
		                    |		ПО ОстаткиПродукцииВЕТИС.Продукция = ВложенныйЗапрос.Продукция";
		
		список.Параметры.УстановитьЗначениеПараметра("номенклатура",номенклатура);
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура КочетовНоменклатураПриИзмененииВместо(Элемент)
	КочетовНоменклатураПриИзмененииВместоНаСервере();
КонецПроцедуры
